In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame({"Values1":["XYS", "10.20", "30.50", "AM", "Aziz", "301"],
                "Values2":[30.20, "40", "WQ", 41, "56", "50"]
                })

In [10]:
df

   Values1  Values2
0      NaN     30.2
1     10.2     40.0
2     30.5      NaN
3      NaN     41.0
4      NaN     56.0
5    301.0     50.0

In [6]:
# want to change values1 and values2 into numeric value

In [7]:
df=df.apply(pd.to_numeric, errors="coerce")

In [9]:
df.dtypes

Values1    float64
Values2    float64
dtype: object

In [11]:
#now drop those rows having NaN values

In [12]:
df=df.dropna()

In [13]:
df

   Values1  Values2
1     10.2     40.0
5    301.0     50.0

In [15]:
#here index is showing 1 and 5 make it starts from 0

In [16]:
df.reset_index(drop=True)

   Values1  Values2
0     10.2     40.0
1    301.0     50.0